Revit.GeometryConversion.GeometryObjectConverter.Convert(Autodesk.Revit.DB.GeometryObject,Autodesk.Revit.DB.Reference,Autodesk.DesignScript.Geometry.CoordinateSystem)
Convert a GeometryObject to an applicable ProtoGeometry type.
geom:
reference:
transform:
Returns: A Geometry type.  Null if there's no suitable conversion.